In [1]:
import pandas as pd

# Question No. (1)

1st function - convert list to dataframe

In [2]:
df = pd.DataFrame([1,2,3,4,5], index = [list(range(5))], columns = ['value'])

In [3]:
df

   value
0      1
1      2
2      3
3      4
4      5

2nd function - creating new column in data frame

3rd function - apply function

In [4]:
def square(x):
    return x**2 ;

df['square_values'] = df['value'].apply(square)

In [5]:
df

   value  square_values
0      1              1
1      2              4
2      3              9
3      4             16
4      5             25

4th function - drop the row or columns

In [6]:
df.drop(1, inplace = True)

adding new column to data frame

In [7]:
df['value_2'] = list(range(4))

In [8]:
df

   value  square_values  value_2
0      1              1        0
2      3              9        1
3      4             16        2
4      5             25        3

Arithmatic operations

In [9]:
df['sum'] = df['value']+df['value_2']

In [10]:
df

   value  square_values  value_2  sum
0      1              1        0    1
2      3              9        1    4
3      4             16        2    6
4      5             25        3    8

6th function - - reset_index

In [11]:
df.reset_index()

   level_0  value  square_values  value_2  sum
0        0      1              1        0    1
1        2      3              9        1    4
2        3      4             16        2    6
3        4      5             25        3    8

# Question - (2)

In [12]:
data = {
    'A' : [1,2,3,4,5],
    'B' : [6,7,8,9,10],
    'C' : [11,12,13,14,15]
}

In [13]:
df = pd.DataFrame(data)

In [14]:
df

   A   B   C
0  1   6  11
1  2   7  12
2  3   8  13
3  4   9  14
4  5  10  15

In [15]:
new_index = range(1, len(df)*2, 2)
df.set_index(pd.Index(new_index))

   A   B   C
1  1   6  11
3  2   7  12
5  3   8  13
7  4   9  14
9  5  10  15

# Question - (3)

In [16]:
data1 = {
   'values' : [10,20,30,40,50,60]
}

In [17]:
df1 = pd.DataFrame(data1)

In [18]:
print("sum of first 3 rows : "+str(df1[0:3].sum()))

sum of first 3 rows : values    60
dtype: int64

# Question - (4)

In [19]:
data2 = {
   'text' : ['JEE', 'NEET','SSC', 'UPSC', 'PW_SKILLS','ENGINEER','DOCTOR']
}

In [20]:
df2 = pd.DataFrame(data2)

In [21]:
df2

        text
0        JEE
1       NEET
2        SSC
3       UPSC
4  PW_SKILLS
5   ENGINEER
6     DOCTOR

In [22]:
df2['word_count']=df2['text'].apply(len)

In [23]:
df2

        text  word_count
0        JEE           3
1       NEET           4
2        SSC           3
3       UPSC           4
4  PW_SKILLS           9
5   ENGINEER           8
6     DOCTOR           6

# Question No. - (5)

In [24]:
data3 = {'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]}

In [25]:
df3 = pd.DataFrame(data3)

--> shape, provide a tuple with no of row and columns in a dataframe

In [26]:
df3.shape

(3, 3)

--> size, gives the total no. of elements in a dataframe

In [27]:
df3.size

9

# Question No. - (6)

pd.read_excel('name of excel sheet here'). 
This is used to read the excel sheet

# Question No. - (7)

In [28]:
df4= pd.DataFrame({
 'email_id':['data_science@gmail.com', 'data_analytics@gmail.com','web_devlopment@gmail.com',
             'app_devlopment@gmail.com','block_chain@gmail.com','cyber_security@gmail.com']
})

In [29]:
df4

                   email_id
0    data_science@gmail.com
1  data_analytics@gmail.com
2  web_devlopment@gmail.com
3  app_devlopment@gmail.com
4     block_chain@gmail.com
5  cyber_security@gmail.com

In [30]:
def find_username(s):
    i= 0 
    for i in range(len(s)):
        if(s[i] == '@'):
            break
        i=i+1
        
    return s[0:i]

In [31]:
df4['username'] = df4['email_id'].apply(find_username)

New Column with username is created

In [32]:
df4

                   email_id        username
0    data_science@gmail.com    data_science
1  data_analytics@gmail.com  data_analytics
2  web_devlopment@gmail.com  web_devlopment
3  app_devlopment@gmail.com  app_devlopment
4     block_chain@gmail.com     block_chain
5  cyber_security@gmail.com  cyber_security

# Question No- (8)

In [33]:
df5 = pd.DataFrame({
    'A':[3,8,6,2,9],
    'B':[5,2,9,3,1],
    'C':[1,7,4,5,2]
})

In [34]:
df5

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

Here, the values in 'A' column are (>5)and values in column 'B' are (<5)

In [35]:
new_dataframe = df5[(df5['A']>5) & (df5['B']<10)]

In [36]:
new_dataframe

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2